Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# ErrorResource_ErrTestPropertyExpected_LongMessage
source: Test functions are those that can be used to simulate user input when testing an app. 'SetProperty', 'SelectRow', and 'Assert' are common test functions. They can only be used in the in test cases.
bg_bg: Тестовите функции са тези, които могат да се използват за симулиране на приноса на потребителите при тестването на приложение. SetProperty, SelectRow и Assert са общи тестови функции. Те могат да се използват само при тестови случаи.
ca_es: Les funcions de prova són aquelles que es poden utilitzar per simular l'entrada de l'usuari en provar una aplicació. "SetProperty", "SelectRow" i "Assert" són funcions comunes de prova i només es poden utilitzar en casos de prova.
cs_cz: Testovací funkce jsou ty, které se dají použít k simulaci vstupů uživatelů při testování aplikace. Mezi běžné testovací funkce patří SetProperty, SelectRow a Assert. Použít se dají jen v testovacích případech.
da_dk: Testfunktioner er dem, der kan bruges til at simulere brugerinput, når en app testes. 'SetProperty', 'SelectRow' og 'Assert' er almindelige testfunktioner. De kan kun bruges i testsagerne.
de_de: Testfunktionen sind solche, die beim Testen einer App zum Simulieren der Benutzereingabe verwendet werden können. "SetProperty", "SelectRow" und "Assert" sind gängige Testfunktionen. Sie können nur in Testfällen verwendet werden.
el_gr: Οι συναρτήσεις δοκιμής είναι αυτές που μπορούν να χρησιμοποιηθούν για την προσομοίωση εισόδου από τον χρήστη κατά τη δοκιμή μιας εφαρμογής. Οι SetProperty, SelectRow και Assert είναι συνήθεις συναρτήσεις δοκιμής. Μπορούν να χρησιμοποιηθούν μόνο σε υποθέσεις δοκιμής.
es_es: Las funciones de prueba son las que pueden usarse para simular la entrada del usuario al probar una aplicación. “SetProperty”, “SelectRow” y “Assert” son funciones de prueba comunes. Solo pueden usarse en casos de prueba.
et_ee: Testimisfunktsioonid on need, mida saab rakenduse testimisel kasutada kasutajasisestuse simuleerimiseks. 'SetProperty', 'SelectRow' ja 'Assert' on levinud testimisfunktsioonid. Neid saab kasutada ainult testjuhtumites.
eu_es: Probako funtzioak aplikazio bat probatzeak erabiltzaile-sarrera simulatzeko erabili daitezkeenak dira. "SetProperty", "SelectRow" eta "Baieztatu" probako funtzio ohikoak dira. Proba-kasuetan soilik erabil daitezke.
fi_fi: Testifunktiot ovat kohteita, joiden avulla voidaan simuloida käyttäjän syötteitä sovellusta testattaessa. SetProperty, SelectRow ja Assert ovat yleisiä testifunktioita. Niitä voi käyttää vain testitapauksissa.
fr_fr: Les fonctions de test peuvent être utilisées pour simuler des entrées utilisateur lors du test d'une application. « SetProperty », « SelectRow » et « Assert » sont des fonctions de test courantes qui ne peuvent être utilisées que dans les cas de test.
gl_es: As funcións de proba son as que poden usarse para simular a entrada de usuarios ao probar unha aplicación. 'SetProperty', 'SelectRow' e 'Assert' son funcións de proba comúns. Só se poden usar nos casos de proba.
hi_in: परीक्षण फ़ंक्शंस वे हैं जिनका उपयोग किसी ऐप के परीक्षण के दौरान उपयोगकर्ता इनपुट का अनुकरण करने के लिए किया जा सकता है. 'SetProperty', 'SelectRow', और 'दृढ़ता' सामान्य परीक्षण फ़ंक्शंस हैं. इनका उपयोग केवल परीक्षण संबंधी मामलों में किया जा सकता है.
hr_hr: Funkcije za testiranje one su funkcije koje se mogu koristiti za simulaciju korisničkog unosa prilikom testiranja aplikacije. 'SetProperty', 'SelectRow' i 'Assert' uobičajene su funkcije za testiranje. Mogu se koristiti samo na testnim slučajevima.
hu_hu: A tesztfüggvények azok, amelyekkel szimulálhatók a felhasználói bemenetek egy alkalmazás tesztelésekor. A SetProperty, a SelectRow és az Assert gyakran használt tesztfüggvények. Ezek csak a tesztesetekben használhatók.
it_it: Le funzioni di test sono funzioni che possono essere usate per simulare l'input dell'utente durante il test di un'app. SetProperty', 'SelectRow' e 'Assert' sono funzioni di test comuni che possono essere usate solo nei test case.
ja_jp: テスト関数は、アプリをテストするときにユーザー入力のシミュレートに使用できます。'SetProperty'、'SelectRow'、'Assert' は、一般的なテスト関数です。これらはテスト ケースでのみ使用できます。
kk_kz: Сынақ функцияларын бағдарламаны сынау кезінде пайдаланушы жазбасын үлгілеу үшін пайдалануға болады. "SetProperty", "SelectRow" және "Assert" – әдеттегі сынақ функциялары. Оларды сынақ жағдайларында ғана пайдалануға болады.
ko_kr: 테스트 함수는 앱을 테스트할 때 사용자 입력을 시뮬레이션하는 데 사용할 수 있는 함수입니다. 'SetProperty', 'SelectRow' 및 'Assert'는 일반적인 테스트 함수로, 테스트 사례에서만 사용할 수 있습니다.
lt_lt: Tikrinimo funkcijos yra tos, kurias galima naudoti vartotojo įvesčiai modeliuoti tikrinant programą. Įprastos tikrinimo funkcijos yra „SetProperty“, „SelectRow“ ir „Assert“. Jas galima naudoti tik tikrinimo atvejuose.
lv_lv: Testa funkcijas ir funkcijas, kuras programmas tetēšanas laikā var izmantot lietotāja ievades simulēšanai. Biežāk lietotās testa funkcijas ir “SetProperty”, “SelectRow” un “Assert”. Tās var lietot tikai testa gadījumos.
ms_my: Fungsi ujian ialah fungsi yang boleh digunakan untuk mensimulasikan input pengguna apabila menguji aplikasi. 'SetProperty', 'SelectRow' dan 'Assert' ialah fungsi ujian biasa. Ia hanya boleh digunakan dalam kes ujian.
nb_no: Testfunksjoner er de som kan brukes til å simulere brukerinndata når en app testes. SetProperty, SelectRow og Assert er vanlige testfunksjoner. De kan bare brukes i testtilfellene.
nl_nl: Testfuncties zijn de functies die kunnen worden gebruikt om gebruikersinvoer te simuleren bij het testen van een app. Veelgebruikte testfuncties zijn SetProperty, SelectRow en Assert. Deze kunnen alleen worden gebruikt in de testcases.
pl_pl: Funkcje testowe służą do symulowania danych wprowadzanych przez użytkownika podczas testowania aplikacji. Typowe funkcje testowe to „SetProperty”, „SelectRow” i „Assert”. Mogą być one używane tylko w przypadkach testowych.
pt_br: As funções de teste são aquelas que podem ser usadas para simular a entrada do usuário durante o teste de um aplicativo. 'SetProperty', 'SelectRow' e 'Assert' são funções de teste comuns. Elas só podem ser usadas nos casos de teste.
pt_pt: As funções de teste são aquelas que podem ser utilizadas para simular a introdução do utilizador durante o teste de uma aplicação. "SetProperty", "SelectRow" e "Assert" são funções de teste comuns. Só podem ser utilizadas nos casos de teste.
ro_ro: Funcțiile de testare sunt cele care pot fi utilizate pentru a simula intrarea utilizatorului atunci când se testează o aplicație. „SetProperty”, „SelectRow” și „Assert” sunt funcții comune de testare. Ele pot fi utilizate numai în cazurile de testare.
ru_ru: Функции теста — это те функции, которые можно использовать для имитации вводимых пользователем данных при тестировании приложения. Основные функции теста — "SetProperty", "SelectRow" и "Assert". Их можно использовать только в тестовых случаях.
sk_sk: Testovacie funkcie sú tie, ktoré možno použiť na simuláciu vstupu používateľa pri testovaní aplikácie. Medzi bežné testovacie funkcie patria SetProperty, SelectRow a Assert. Môžu sa používať iba v testovacích prípadoch.
sl_si: Preskusne funkcije so funkcije, ki jih je mogoče uporabiti za simuliranje vnosa uporabnika pri preskušanju aplikacije. Pogoste preskusne funkcije so »SetProperty«, »SelectRow« in »Assert«. Uporabiti jih je mogoče samo za primere preskušanja.
sr_cyrl_rs: Функције за тестирање су оне које се могу користити за симулацију уноса корисника приликом тестирања апликација. „SetProperty“, „SelectRow“ и „Assert“ честе су функције за тестирање. Могу се користити само током тестирања.
sr_latn_rs: Funkcije za testiranje su one koje se mogu koristiti za simulaciju unosa korisnika prilikom testiranja aplikacija. „SetProperty“, „SelectRow“ i „Assert“ česte su funkcije za testiranje. Mogu se koristiti samo tokom testiranja.
sv_se: Testfunktioner är sådana som kan användas för att simulera användarindata vid testning av en app. SetProperty, SelectRow och Assert är vanliga testfunktioner. De kan bara användas i testfall.
th_th: ฟังก์ชันการทดสอบเป็นฟังก์ชันที่สามารถใช้เพื่อจำลองข้อมูลป้อนเข้าของผู้ใช้เมื่อทดสอบแอป "SetProperty", "SelectRow" และ "Assert" เป็นฟังก์ชันการทดสอบทั่วไป โดยสามารถใช้ได้เฉพาะในกรณีทดสอบเท่านั้น
tr_tr: Test işlevleri, bir uygulamayı test ederken kullanıcı girişinin benzetimini yapmak için kullanılabilen bağlantılardır. 'SetProperty', 'SelectRow' ve 'Assert', ortak test işlevlerdir. Yalnızca test çalışmaları içinde kullanılabilirler.
uk_ua: Тестові функції – це функції, які можна використовувати для імітації введених користувачем даних під час тестування програми. SetProperty, SelectRow і Assert – загальні тестові функції. Їх можна використовувати лише в тестовому сценарії.
vi_vn: Hàm thử nghiệm là những hàm có thể dùng để mô phỏng đầu vào người dùng khi thử nghiệm ứng dụng. 'SetProperty', 'SelectRow' và 'Assert' là các hàm thử nghiệm phổ biến. Chỉ có thể sử dụng chúng trong các trường hợp thử nghiệm.
zh_cn: 测试函数是在测试应用时可用于模拟用户输入的函数。"SetProperty"、"SelectRow" 和 "Assert" 是常见的测试函数。它们只能在测试用例中使用。
zh_tw: 測試函式是測試應用程式時，可用於模擬使用者輸入的函式。'SetProperty'、'SelectRow' 和 'Assert' 是常用的測試函式。只能在測試案例中使用它們。

# ErrorResource_ErrTestPropertyExpected_HowToFix_1
source: Use the function in a test case, not in the app itself.
bg_bg: Използвайте функцията в тестов случай, а не в самото приложение.
ca_es: Utilitzeu la funció en un cas de prova, en lloc de a la mateixa aplicació.
cs_cz: Použijte funkci v testovacím případu, nikoli v samotné aplikaci.
da_dk: Brug funktionen i en testsag, ikke i selve appen.
de_de: Verwenden Sie die Funktion in einem Testfall, nicht in der App selbst.
el_gr: Χρησιμοποιήστε τη συνάρτηση σε μια υπόθεση δοκιμής και όχι στην ίδια την εφαρμογή.
es_es: Use la función en un caso de prueba, no en la aplicación en sí.
et_ee: Kasutage funktsiooni testjuhtumis, mitte rakenduses endas.
eu_es: Erabili funtzioa proba-kasu batean, ez aplikazioan.
fi_fi: Käytä funktiota testitapauksessa, ei itse sovelluksessa.
fr_fr: Utilisez la fonction dans un cas de test, et non dans l'application.
gl_es: Use a función nun caso de proba, non na propia aplicación.
hi_in: परीक्षण मामले में फ़ंक्शन का उपयोग करें, ऐप में ही नहीं.
hr_hr: Tu funkciju koristite na testnom slučaju, a ne u samoj aplikaciji.
hu_hu: A függvényt egy tesztesetben használja, ne magában az alkalmazásban.
it_it: Usare la funzione in un test case, non nell'app stessa.
ja_jp: この関数は、アプリ自体ではなく、テスト ケースで使用してください。
kk_kz: Функцияны бағдарламада емес, сынақ жағдайында пайдаланыңыз.
ko_kr: 앱 자체가 아니라 테스트 사례에서 함수를 사용하세요.
lt_lt: Naudokite funkciją tikrinimo atvejyje, o ne pačioje programoje.
lv_lv: Izmantojiet funkciju testa gadījumā, nevis pašā programmā.
ms_my: Gunakan fungsi dalam kes ujian, bukan dalam aplikasi itu sendiri.
nb_no: Bruk funksjonen i et testtilfelle, ikke i selve appen.
nl_nl: Gebruik de functie in een testcase, maar niet in de app zelf.
pl_pl: Użyj funkcji w przypadku testowym, a nie w samej aplikacji.
pt_br: Use a função em um caso de teste, não no próprio aplicativo.
pt_pt: Utilize a função num caso de teste, não na própria aplicação.
ro_ro: Utilizați funcția într-un caz de testare, nu în aplicația în sine.
ru_ru: Используйте функцию в тестовом случае, а не в самом приложении.
sk_sk: Použite funkciu v testovacom prípade, nie v samotnej aplikácii.
sl_si: Uporabite funkcijo v preskusnem primeru in ne v sami aplikaciji.
sr_cyrl_rs: Користите функцију у пробном случају, не у самој апликацији.
sr_latn_rs: Koristite funkciju u probnom slučaju, ne u samoj aplikaciji.
sv_se: Använd funktionen i ett testfall, inte i själva appen.
th_th: ใช้ฟังก์ชันในกรณีทดสอบ ไม่ใช่ในแอป
tr_tr: İşlevi uygulamanın kendisinde değil, bir test çalışmasında kullanın.
uk_ua: Використовуйте функцію в тестовому сценарії, а не в самій програмі.
vi_vn: Sử dụng hàm trong trường hợp thử nghiệm chứ không phải trong chính ứng dụng.
zh_cn: 在测试用例(而非应用本身)中使用此函数。
zh_tw: 在測試案例中使用函式，而不是在應用程式本身中。

# ErrorResource_ErrCannotCoerce_SourceType_TargetType_ShortMessage
source: Can't convert this data type. Power Apps can't convert this {0} to a {1}.
bg_bg: Преобразуването на този тип данни не е възможно. Power Apps не може да преобразува {0} в/ъв {1}.
ca_es: No es pot convertir aquest tipus de dades. El Power Apps no pot convertir l'element {0} en un element {1}.
cs_cz: Tento datový typ se nedá převést. Power Apps nemůže tento typ {0} převést na typ {1}.
da_dk: Det er ikke muligt at konvertere denne datatype. Power Apps kan ikke konvertere denne {0} til en {1}.
de_de: Dieser Datentyp kann nicht konvertiert werden. Power Apps kann diese Daten vom Typ "{0}" nicht in den Typ "{1}" konvertieren.
el_gr: Δεν είναι δυνατή η μετατροπή αυτού του τύπου δεδομένων. Το Power Apps δεν μπορεί να μετατρέψει αυτό το στοιχείο {0} σε {1}.
es_es: No se puede convertir este tipo de datos. Power Apps no puede convertir {0} en {1}.
et_ee: Seda andmetüüpi ei saa teisendada. Power Apps ei saa teisendada tüüpi {0} tüübiks {1}.
eu_es: Ezin da bihurtu datu mota hori. Power Apps-ek ezin du bihurtu {0} mota {1} mota.
fi_fi: Tätä tietotyyppiä ei voi muuntaa. Power Apps ei voi muuntaa tätä tyyppiä {0} tyypiksi {1}.
fr_fr: Impossible de convertir ce type de données. Power Apps ne peut pas convertir ce {0} en {1}.
gl_es: Non se pode converter este tipo de datos. Power Apps non pode converter este valor de {0} en {1}.
hi_in: इस डेटा प्रकार को रूपांतरित नहीं किया जा सकता. Power Apps इस {0} को {1} में रूपांतरित नहीं कर सकता.
hr_hr: Nije moguće pretvoriti tu vrstu podataka. Power Apps ne može pretvoriti {0} u {1}.
hu_hu: Ez az adattípus nem konvertálható. A Power Apps nem tudja konvertálni a(z) {0} típust {1} típusra.
it_it: Non è possibile convertire questo tipo di dati. Power Apps non può convertire il tipo {0} in {1}.
ja_jp: このデータ型を変換できません。Power Apps はこの {0} を {1} に変換できません。
kk_kz: Бұл деректер түрін түрлендіру мүмкін емес. Power Apps бұл {0} {1} етіп түрлендіре алмайды.
ko_kr: 이 데이터 형식으로 변환할 수 없습니다. Power Apps에서는 이 {0}을(를) {1}(으)로 변환할 수 없습니다.
lt_lt: Negalima konvertuoti šio duomenų tipo. „Power Apps“ negali konvertuoti šio {0} į {1}.
lv_lv: Nevar pārvērst šāda tipa datus. Power Apps nevar pārvērst “{0}” datus par “{1}” datiem.
ms_my: Tidak dapat menukar data jenis ini. Power Apps tidak dapat menukar {0} ini kepada {1}.
nb_no: Kan ikke konvertere denne datatypen. Power Apps kan ikke konvertere denne {0} til en {1}.
nl_nl: Kan dit gegevenstype niet converteren. Power Apps kan een {0} niet converteren naar een {1}.
pl_pl: Nie można przekonwertować tego typu danych. Usługa Power Apps nie może przekonwertować danych typu {0} na {1}.
pt_br: Não é possível converter esse tipo de dados. O Power Apps não pode converter esse {0} em um {1}.
pt_pt: Não pode converter este tipo de dados. O Power Apps não pode converter este {0} para um {1}.
ro_ro: Nu se poate converti acest tip de date. Power Apps nu poate converti acest {0} la {1}.
ru_ru: Невозможно преобразовать этот тип данных. Power Apps не может преобразовать {0} в {1}.
sk_sk: Tento typ údajov sa nedá konvertovať. Služba Power Apps nemôže konvertovať tento typ {0} na typ {1}.
sl_si: Tega podatkovnega tipa ni mogoče pretvoriti. Power Apps ne more pretvoriti tega tipa {0} v {1}.
sr_cyrl_rs: Није могуће конвертовати овај тип података. Power Apps не може да конвертује {0} у {1}.
sr_latn_rs: Nije moguće konvertovati ovaj tip podataka. Power Apps ne može da konvertuje {0} u {1}.
sv_se: Det går inte att konvertera den här datatypen. PowerApps kan inte konvertera den här {0} till en {1}.
th_th: ไม่สามารถแปลงชนิดข้อมูลนี้ได้ Power Apps ไม่สามารถแปลง {0} นี้เป็น {1} ได้
tr_tr: Bu veri türü dönüştürülemiyor. Power Apps bu {0} türünü {1} türüne dönüştüremiyor.
uk_ua: Не вдалося перетворити цей тип даних. Power Apps не може перетворити тип "{0}" на тип "{1}".
vi_vn: Không thể chuyển đổi kiểu dữ liệu này. Power Apps không thể chuyển đổi {0} này thành {1}.
zh_cn: 无法转换此数据类型。Power Apps 不可将此 {0} 转换为 {1}。
zh_tw: 無法轉換此資料類型。Power Apps 無法將此 {0} 轉換為 {1}。
